<h1 align="center"> 5.1 Series and DataFrames

In [1]:
import pandas as pd
from pandas import Series,DataFrame

In [2]:
obj=pd.Series([1,2,3,4])
print(obj.index)
obj

RangeIndex(start=0, stop=4, step=1)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
obj=pd.Series([1,2,3,4],index=["s","a","n","k"])
print(obj.index)
obj

Index(['s', 'a', 'n', 'k'], dtype='object')

s    1
a    2
n    3
k    4
dtype: int64

In [4]:
's' in obj

True

In [5]:
1 in obj

False

In [6]:
dicto={1:"s",3:"f",3:"u",4:"i",5:"r"}
obj=pd.Series(dicto)
obj

1    s
3    u
4    i
5    r
dtype: object

In [7]:
obj.isnull()

1    False
3    False
4    False
5    False
dtype: bool

In [8]:
obj1=pd.Series([1,2,3,4,5],index=[5,8,9,6,3])
obj2=pd.Series([1,2,3,4,5],index=[3,6,9,8,5])
obj1+obj2

3    6
5    6
6    6
8    6
9    6
dtype: int64

In [9]:
obj.name="How Ya Doing"
obj.index.name="You have failed this city"
obj

You have failed this city
1    s
3    u
4    i
5    r
Name: How Ya Doing, dtype: object

In [10]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [11]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [12]:
frame=pd.DataFrame(data, columns=['year', 'state', 'pop','rock'])
frame

   year   state  pop rock
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [13]:
frame.columns

Index(['year', 'state', 'pop', 'rock'], dtype='object')

In [14]:
frame['year']

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [15]:
frame.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [17]:
frame.iloc[1,3]

nan

In [18]:
sub=pd.Series([2.2],index=[3])
frame['rock']=sub
frame

   year   state  pop  rock
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   2.2
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [19]:
frame["east coast"]=frame.state=="Ohio"
frame

   year   state  pop  rock  east coast
0  2000    Ohio  1.5   NaN        True
1  2001    Ohio  1.7   NaN        True
2  2002    Ohio  3.6   NaN        True
3  2001  Nevada  2.4   2.2       False
4  2002  Nevada  2.9   NaN       False
5  2003  Nevada  3.2   NaN       False

In [20]:
del frame["east coast"]